{
  "projects": [
    {
      "id": "approachsolutions",
      "title": "Approach Solutions",
      "image": "/ai_growingteams.png",
      "startDate": "2021-07",
      "endDate": "2024-07",
      "description": "A web and mobile application centering around payroll. Our business operations include rostering, performance monitoring, reporting, and auditing; all vital for efficiency and compliance. We also include billing, costing, and performance assessment.",
      "projectUrl": "https://www.growing-teams.com/",
      "technologiesUsed": [
        "TypeScript",
        "React",
        "SAP HANA",
        "React Native",
        "Next.js",
        "MySQL",
        "PostgreSQL",
        "MongoDB",
        "REST API",
        "Docker",
        "GitHub",
        "Azure",
        "Teams",
        "Material UI",
        "JSON",
        "XML",
        "WordPress"
      ]
    },
    {
      "id": "gardenguru",
      "title": "Garden Guru",
      "image": "/gardenguru.png",
      "startDate": "2025-01",
      "endDate": "2025-05",
      "description": "Garden Guru is a comprehensive gardening app designed to assist both novice and experienced gardeners in planning, planting, and maintaining their gardens. The app offers expert advice on growing conditions, diagnosing plant ailments, and organic gardening practices.",
      "githubUrl": "https://github.com/AlexanderBarr/gardenguru/",
      "technologiesUsed": [
        "TypeScript",
        "Next.js",
        "Azure",
        "React",
        "Node.js",
        "Tailwind CSS",
        "GitHub"
      ]
    },
    {
      "id": "ambitioneducation",
      "title": "Ambition Education",
      "image": "/ambitioneducation.png",
      "startDate": "2021-07",
      "endDate": "2021-08",
      "description": "Ambition Education is a tutoring centre in Katoomba, NSW, founded in 2015 by Steve West, who brings over a decade of experience in the Sydney coaching college sector. The centre offers tailored tutoring for students from Kindergarten to Year 12, covering a wide range of subjects including English, Mathematics, Science, History, and more.",
      "projectUrl": "https://ambitioneducation.com.au/",
      "technologiesUsed": ["WordPress", "JavaScript"]
    },
    {
      "id": "essaycheck",
      "title": "Essay Check",
      "image": "/editessay.png",
      "startDate": "2019-03",
      "endDate": "2019-04",
      "description": "Essay Check is a professional editing website that helps writers perfect their work—whether it's an essay, novel, thesis, or article. With a team of experienced human editors, Essay Check focuses on improving clarity, grammar, structure, and overall readability, ensuring your writing is polished, professional, and ready to impress.",
      "projectUrl": "https://essaycheck.com.au",
      "technologiesUsed": ["WordPress", "JavaScript"]
    },
    {
      "id": "CRDesign",
      "title": "CRDesign",
      "image": "/crdesign.png",
      "startDate": "2019-01",
      "endDate": "2019-02",
      "description": "CRDesign is a Sydney-based interior design company renowned for creating elegant, functional spaces tailored to each client's unique style. Specialising in residential and boutique commercial interiors, CRDesign blends contemporary aesthetics with timeless comfort. From concept to completion, they deliver thoughtful design solutions that elevate everyday living.",
      "projectUrl": "https://crdesign.com.au/",
      "technologiesUsed": ["WordPress", "JavaScript"]
    },
    {
      "id": "timthetiler",
      "title": "Tim the Tiler",
      "image": "/timthetiler.png",
      "startDate": "2019-10",
      "endDate": "2019-11",
      "description": "Tim the tiler is a trusted tiling company known for precision, reliability, and top-quality craftsmanship. Serving Penrith and surrounding areas, Tim the tiler specializes in residential and commercial tiling projects—ranging from kitchens and bathrooms to outdoor spaces. With a keen eye for detail and a commitment to excellence, they turn surfaces into standout features that last.",
      "projectUrl": "https://timthetiler.com.au/",
      "technologiesUsed": ["WordPress", "JavaScript"]
    }
  ]
}
